2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/KUC091-Buitenland_request_template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:brp="http://www.bzk.nl/brp/brp0200">
   <soapenv:Header/>
   <soapenv:Body>
      <brp:bhg_ovlRegistreerOverlijden>
         <brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
            <brp:zendendePartij>${DataSource Values#zendendePartij_zsO0}</brp:zendendePartij>
            <brp:zendendeSysteem>${DataSource Values#zendendeSysteem_zsO0}</brp:zendendeSysteem>
            <brp:referentienummer>${DataSource Values#referentienummer_sOO0}</brp:referentienummer>
            <brp:tijdstipVerzending>[moment_volgen]</brp:tijdstipVerzending>
         </brp:stuurgegevens>
         <brp:parameters brp:communicatieID="${DataSource Values#comid.parameters_pOO0}">
            <brp:verwerkingswijze>${DataSource Values#verwerkingswijze_pOO0}</brp:verwerkingswijze>
         </brp:parameters>
         <!--You have a CHOICE of the next 2 items at this level-->
         <brp:overlijdenInNederland brp:objecttype="AdministratieveHandeling" brp:communicatieID="${DataSource Values#comid.overlijdenInNederland_rOO0}">
            <brp:partijCode >${DataSource Values#partijCode_rOO0}</brp:partijCode>
            <!--Optional:-->
            <brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_rOO0}</brp:toelichtingOntlening>
            <!--Optional:-->
            <brp:gedeblokkeerdeMeldingen>
               <!--1 or more repetitions:-->
               <brp:gedeblokkeerdeMelding brp:objecttype="GedeblokkeerdeMelding" brp:referentieID="${DataSource Values#|refid.gedeblokkeerdeMelding0|}" brp:communicatieID="${DataSource Values#comid.gedeblokkeerdeMelding_ggr0}">
                  <brp:regelCode>${DataSource Values#regelCode_ggr0}</brp:regelCode>
                  <!--Optional:-->
                  <brp:elementNaam>${DataSource Values#elementNaam_ggr0}</brp:elementNaam>
               </brp:gedeblokkeerdeMelding>
            </brp:gedeblokkeerdeMeldingen>
            <!--Optional:-->
            <brp:bronnen>
               <!--1 or more repetitions:-->
				<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron1}">
				   <brp:document brp:objecttype="Document" brp:communicatieID="Document1">
					  <brp:soortNaam>${DataSource Values#soortNaam_ddr0}</brp:soortNaam>
					  <brp:identificatie>${DataSource Values#identificatie_ddr0}</brp:identificatie>
					  <!--Optional:-->
					  <brp:aktenummer>${DataSource Values#aktenummer_ddr0}</brp:aktenummer>
					  <brp:partijCode>${DataSource Values#partijCode_ddr0}</brp:partijCode>
				   </brp:document>
				</brp:bron>   
				<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron2}">
				   <brp:document brp:objecttype="Document" brp:communicatieID="Document2">
					  <brp:soortNaam>${DataSource Values#soortNaam_ddr1}</brp:soortNaam>
					  <brp:identificatie>${DataSource Values#identificatie_ddr1}</brp:identificatie>
					  <!--Optional:-->
					  <brp:aktenummer>${DataSource Values#aktenummer_ddr1}</brp:aktenummer>
					  <brp:partijCode>${DataSource Values#partijCode_ddr1}</brp:partijCode>
				   </brp:document>
				</brp:bron>
            </brp:bronnen>
            <brp:acties>
               <brp:registratieOverlijden brp:objecttype="Actie" brp:communicatieID="${DataSource Values#comid.registratieOverlijden_rar0}">
                  <brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rar0}</brp:datumAanvangGeldigheid>
                  <!--Optional:-->
                  <brp:bronnen>
						<!--You have a CHOICE of the next 1 items at this level-->
						<!--Zero or more repetitions:-->
						<brp:bron brp:communicatieID="BronDocument1"
								  brp:referentieID="${DataSource Values#refid.bron1}"
								  brp:objecttype="ActieBron">
						</brp:bron>
						<brp:bron brp:communicatieID="BronDocument2"
								  brp:referentieID="${DataSource Values#refid.bron2}"
								  brp:objecttype="ActieBron">
						</brp:bron>
					 </brp:bronnen>
                  <brp:persoon brp:objecttype="Persoon" brp:objectSleutel="${DataSource Values#|bsn_opr0|}" brp:communicatieID="${DataSource Values#comid.persoon_opr0}">
                     <brp:overlijden brp:communicatieID="${DataSource Values#comid.overlijden_opr0}">
                        <brp:datum>${DataSource Values#datum_opr0}</brp:datum>
                        <!--Optional:-->
                        <brp:gemeenteCode>${DataSource Values#gemeenteCode_opr0}</brp:gemeenteCode>
                        <!--Optional:-->
                        <brp:woonplaatsnaam>${DataSource Values#woonplaatsnaam_opr0}</brp:woonplaatsnaam>
                     </brp:overlijden>
                  </brp:persoon>
               </brp:registratieOverlijden>
            </brp:acties>
         </brp:overlijdenInNederland>
         <brp:overlijdenInBuitenland brp:objecttype="AdministratieveHandeling" brp:communicatieID="${DataSource Values#comid.overlijdenInBuitenland_rOO1}">
            <brp:partijCode>${DataSource Values#partijCode_rOO1}</brp:partijCode>
            <!--Optional:-->
            <brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_rOO1}</brp:toelichtingOntlening>
            <!--Optional:-->
            <brp:gedeblokkeerdeMeldingen>
               <!--1 or more repetitions:-->
               <brp:gedeblokkeerdeMelding brp:objecttype="GedeblokkeerdeMelding" brp:referentieID="${DataSource Values#|refid.gedeblokkeerdeMelding1|}" brp:communicatieID="${DataSource Values#comid.gedeblokkeerdeMelding_ggr1}">
                  <brp:regelCode>${DataSource Values#regelCode_ggr1}</brp:regelCode>
                  <!--Optional:-->
                  <brp:elementNaam>${DataSource Values#elementNaam_ggr1}</brp:elementNaam>
               </brp:gedeblokkeerdeMelding>
            </brp:gedeblokkeerdeMeldingen>
            <!--Optional:-->
            <brp:bronnen>
               <!--1 or more repetitions:-->
			   
				<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron3}">
				   <brp:document brp:objecttype="Document" brp:communicatieID="Document3">
					  <brp:soortNaam>${DataSource Values#soortNaam_ddr2}</brp:soortNaam>
					  <brp:identificatie>${DataSource Values#identificatie_ddr2}</brp:identificatie>
					  <!--Optional:-->
					  <brp:aktenummer>${DataSource Values#aktenummer_ddr2}</brp:aktenummer>
					  <brp:partijCode>${DataSource Values#partijCode_ddr2}</brp:partijCode>
				   </brp:document>
				</brp:bron>   
				<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron4}">
				   <brp:document brp:objecttype="Document" brp:communicatieID="Document4">
					  <brp:soortNaam>${DataSource Values#soortNaam_ddr3}</brp:soortNaam>
					  <brp:identificatie>${DataSource Values#identificatie_ddr3}</brp:identificatie>
					  <!--Optional:-->
					  <brp:aktenummer>${DataSource Values#aktenummer_ddr3}</brp:aktenummer>
					  <brp:partijCode>${DataSource Values#partijCode_ddr3}</brp:partijCode>
				   </brp:document>
				</brp:bron>  
            </brp:bronnen>
            <brp:acties>
               <brp:registratieOverlijden brp:objecttype="Actie" brp:communicatieID="${DataSource Values#comid.registratieOverlijden_rar1}">
                  <brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rar1}</brp:datumAanvangGeldigheid>
                  <brp:bronnen>
                     <!--You have a CHOICE of the next 1 items at this level-->
                     <!--Zero or more repetitions:-->
						<!--You have a CHOICE of the next 1 items at this level-->
						<!--Zero or more repetitions:-->
						<brp:bron brp:communicatieID="BronDocument3"
								  brp:referentieID="${DataSource Values#refid.bron3}"
								  brp:objecttype="ActieBron">
						</brp:bron>
						<brp:bron brp:communicatieID="BronDocument4"
								  brp:referentieID="${DataSource Values#refid.bron4}"
								  brp:objecttype="ActieBron">
						</brp:bron>
                  </brp:bronnen>
                  <brp:persoon brp:objecttype="Persoon" brp:objectSleutel="${DataSource Values#|bsn_opr1|}" brp:communicatieID="${DataSource Values#comid.persoon_opr1}">
                     <brp:overlijden brp:communicatieID="comid.overlijden_opr1">
                        <brp:datum>${DataSource Values#datum_opr1}</brp:datum>
                        <!--Optional:-->
                        <brp:buitenlandsePlaats>${DataSource Values#buitenlandsePlaats_opr1}</brp:buitenlandsePlaats>
                        <!--Optional:-->
                        <brp:buitenlandseRegio>${DataSource Values#buitenlandseRegio_opr1}</brp:buitenlandseRegio>
                        <!--Optional:-->
                        <brp:omschrijvingLocatie>${DataSource Values#omschrijvingLocatie_opr1}</brp:omschrijvingLocatie>
                        <brp:landGebiedCode>${DataSource Values#landGebiedCode_opr1}</brp:landGebiedCode>
                     </brp:overlijden>
                  </brp:persoon>
               </brp:registratieOverlijden>
            </brp:acties>
         </brp:overlijdenInBuitenland>
      </brp:bhg_ovlRegistreerOverlijden>
   </soapenv:Body>
</soapenv:Envelope>
